src/Documents/ЗакупкаТоваров/ЗакупкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТоваров</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
  <registerRecords>AccumulationRegister.Задолженности</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПартииТоваровНаСкладах/ПартииТоваровНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.СменаМетодаРасчетаСебестоимости</types>
      <types>DocumentRef.ЗакупкаТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухгалтерскийУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.БухгалтерскийУчет.AccountingFlag.Суммовой</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.БухгалтерскийУчет.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.БухгалтерскийУчет.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.БухгалтерскийУчет.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

src/AccumulationRegisters/Задолженности/Задолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Задолженности</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/СпособРасчетаСебестоимости/СпособРасчетаСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпособРасчетаСебестоимости</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимости</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/ЦенаТовара/ЦенаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаТовара</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СпособыРасчетаСебестоимости/СпособыРасчетаСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаСебестоимости</name>
  <enumValues>
    <name>FIFO</name>
  </enumValues>
  <enumValues>
    <name>LIFO</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднему</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfAccounts/БухгалтерскийУчет/БухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухгалтерскийУчет</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Себестоимость</name>
        <description>Себестоимость</description>
        <code>90.2</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>String</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Контрагенты</types>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/Documents/ЗакупкаТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
			
	
	
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	Движения.РегистрБухУчет.Записывать         = Истина;
	Движения.Задолженности.Записывать          = Истина;
	
	//Берем из регистра сведений последний установленный метод расчета себестоимости
	МетодРасчетаСебестоимости = РегистрыСведений.СпособРасчетаСебестоимости.ПолучитьПоследнее(Дата);
	
	Если МетодРасчетаСебестоимости = Неопределено Тогда
		Сообщить("Не задан способ расчёта себестоимости!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийМетод = МетодРасчетаСебестоимости.МетодРасчета;
	
	
	//Если метод расчета себестоимости - по-среднему, то в партии указываем пустую ссылку
	//В другом случае - ссылку на текущий документ
	
	
	//Если метод не установлен - отказываем в проведении
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		
		Если ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.FIFO ИЛИ ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.LIFO Тогда
			
			//регистр ПартииТоваровНаСкладах Приход
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
			Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
			Движение.Период       = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Товар;
			Движение.Склад        = Склад;
			Движение.Партия       = Ссылка;
			Движение.Количество   = ТекСтрокаТовары.Количество;
			Движение.Сумма        = ТекСтрокаТовары.Сумма;
			
		ИначеЕсли ТекущийМетод = Перечисления.СпособыРасчетаСебестоимости.ПоСреднему Тогда
			
		    //регистр ПартииТоваровНаСкладах Приход
			Движение = Движения.ПартииТоваровНаСкладах.Добавить();
			Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
			Движение.Период       = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Товар;
			Движение.Склад        = Склад;
			Движение.Партия       = Документы.ЗакупкаТоваров.ПустаяСсылка();
			Движение.Количество   = ТекСтрокаТовары.Количество;
			Движение.Сумма        = ТекСтрокаТовары.Сумма;
		КонецЕсли;
		
	

		
		//Проходим по каждой строке табличной части и цену товара сохраняем в регистр сведений
		МенеджерЗаписи = РегистрыСведений.ЦенаТовара.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = ТекСтрокаТовары.Товар;
		МенеджерЗаписи.Цена         = ТекСтрокаТовары.Цена;
		МенеджерЗаписи.Записать(); //Если запись есть - обновит, если нет - создаст
		
		
		//РегистрБухУчет
		//в цикле, т.к. субконто для каждого товара из ТЧ
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Товары;  //41
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Поставщики; //62
		Движение.Период = Дата;
		Движение.Сумма  = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаТовары.Товар;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты]  = Поставщик;
		
		
		
	КонецЦикла;
	
	
	Движение = Движения.Задолженности.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Контрагент  = Поставщик;
	Движение.СуммаДолга  = СуммаДокумента;
	Движение.Период      = Дата;
	
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Вычисление суммы всего документа
	СуммаДокумента = Товары.Итог("Сумма"); //Обращаемся к колонке Сумма в ТЧ Товары
		
КонецПроцедуры
